In [1]:
import cx_Oracle

In [18]:
con = cx_Oracle.connect('xe/xe@//localhost:1521/xe')

In [6]:
print(con.version)

11.2.0.2.0

In [7]:
cursor = con.cursor()

In [8]:
import pandas as pd

In [9]:
cursor.execute("create table employee(empid integer primary key, name varchar2(30), salary number(10, 2))")
con.commit()

In [10]:
cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (1, 'Puneet',20000.00 )");

cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (2, 'pitti',15000.00 )");

cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (3, 'eddy',20000.00 )");

cursor.execute("INSERT INTO employee(empid,name,salary) \
      VALUES (4, 'amit',65000.00 )");

con.commit()

In [11]:
df=pd.read_sql('select * from employee',con)

In [12]:
df

   EMPID    NAME   SALARY
0      1  Puneet  20000.0
1      2   pitti  15000.0
2      3    eddy  20000.0
3      4    amit  65000.0

In [20]:
.dataframe tbody tr th {
    vertical-align: top;
}

.dataframe thead th {
    text-align: right;
}

   EMPID    NAME   SALARY
0      1  Puneet  20000.0
1      2   pitti  15000.0
2      3    eddy  20000.0
3      4    amit  65000.0